In [2]:
import pandas as pd

In [6]:
Animals = {"Name": ["Dog", "Cat", "Chicken", "Horse", "Shark", "Lion", "Wolf", "Tiger"],
          "Species": ["Mammal", "Mammal", "Bird", "Mammal", "Fish", "Mammal", "Mammal", "Mammal"],
          "Continnet": ["Everywhere", "Everywhere", "Asia and Americas", "Everywhere", "Everywhere", "Africa", "Europe and Asia", "Asia"]}

In [51]:
df = pd.DataFrame(Animals)

In [10]:
print(df.to_string())

      Name Species          Continnet
0      Dog  Mammal         Everywhere
1      Cat  Mammal         Everywhere
2  Chicken    Bird  Asia and Americas
3    Horse  Mammal         Everywhere
4    Shark    Fish         Everywhere
5     Lion  Mammal             Africa
6     Wolf  Mammal    Europe and Asia
7    Tiger  Mammal               Asia

In [12]:
display(df)

      Name Species          Continnet
0      Dog  Mammal         Everywhere
1      Cat  Mammal         Everywhere
2  Chicken    Bird  Asia and Americas
3    Horse  Mammal         Everywhere
4    Shark    Fish         Everywhere
5     Lion  Mammal             Africa
6     Wolf  Mammal    Europe and Asia
7    Tiger  Mammal               Asia

In [100]:
df.loc[[0]]

  Name Species   Continnet
0  Dog  Mammal  Everywhere

In [96]:
df.loc[:4, ["Name", "Species"]]

      Name Species
0      Dog  Mammal
1      Cat  Mammal
2  Chicken    Bird
3    Horse  Mammal
4    Shark    Fish

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       8 non-null      object
 1   Species    8 non-null      object
 2   Continnet  8 non-null      object
dtypes: object(3)
memory usage: 324.0+ bytes

In [57]:
df.dropna(inplace= True)

In [59]:
df

      Name Species          Continnet
0      Dog  Mammal         Everywhere
1      Cat  Mammal         Everywhere
2  Chicken    Bird  Asia and Americas
3    Horse  Mammal         Everywhere
4    Shark    Fish         Everywhere
5     Lion  Mammal             Africa
6     Wolf  Mammal    Europe and Asia
7    Tiger  Mammal               Asia

In [61]:
print(df.to_string())

      Name Species          Continnet
0      Dog  Mammal         Everywhere
1      Cat  Mammal         Everywhere
2  Chicken    Bird  Asia and Americas
3    Horse  Mammal         Everywhere
4    Shark    Fish         Everywhere
5     Lion  Mammal             Africa
6     Wolf  Mammal    Europe and Asia
7    Tiger  Mammal               Asia

In [65]:
df.duplicated("Continnet")

0    False
1     True
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool

In [67]:
df.drop_duplicates("Continnet")

      Name Species          Continnet
0      Dog  Mammal         Everywhere
2  Chicken    Bird  Asia and Americas
5     Lion  Mammal             Africa
6     Wolf  Mammal    Europe and Asia
7    Tiger  Mammal               Asia

In [69]:
df.reset_index()

   index     Name Species          Continnet
0      0      Dog  Mammal         Everywhere
1      1      Cat  Mammal         Everywhere
2      2  Chicken    Bird  Asia and Americas
3      3    Horse  Mammal         Everywhere
4      4    Shark    Fish         Everywhere
5      5     Lion  Mammal             Africa
6      6     Wolf  Mammal    Europe and Asia
7      7    Tiger  Mammal               Asia

In [71]:
print(df.to_string())

      Name Species          Continnet
0      Dog  Mammal         Everywhere
1      Cat  Mammal         Everywhere
2  Chicken    Bird  Asia and Americas
3    Horse  Mammal         Everywhere
4    Shark    Fish         Everywhere
5     Lion  Mammal             Africa
6     Wolf  Mammal    Europe and Asia
7    Tiger  Mammal               Asia

In [102]:
df

      Name Species          Continnet
0      Dog  Mammal         Everywhere
1      Cat  Mammal         Everywhere
2  Chicken    Bird  Asia and Americas
3    Horse  Mammal         Everywhere
4    Shark    Fish         Everywhere
5     Lion  Mammal             Africa
6     Wolf  Mammal    Europe and Asia
7    Tiger  Mammal               Asia